# 필요한 변수만 추출하기
- []기호 사용하기

In [2]:
import pandas as pd
exam = pd.read_csv('./data/exam.csv')
exam.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

In [9]:
math = exam['math']
math.head()

0    50
1    60
2    45
3    30
4    25
Name: math, dtype: int64

In [6]:
math = exam['math']
math.describe()

count    20.000000
mean     57.450000
std      20.299015
min      20.000000
25%      45.750000
50%      54.000000
75%      75.750000
max      90.000000
Name: math, dtype: float64

In [7]:
english = exam['english']
english.info()

<class 'pandas.core.series.Series'>
RangeIndex: 20 entries, 0 to 19
Series name: english
Non-Null Count  Dtype
--------------  -----
20 non-null     int64
dtypes: int64(1)
memory usage: 288.0 bytes

## 여러 변수 추출하기
- []안에 다시 []를 넣어 변수명 나열하기

In [8]:
new_exam = exam[['nclass', 'math', 'english']]
new_exam.head()

   nclass  math  english
0       1    50       98
1       1    60       97
2       1    45       86
3       1    30       98
4       2    25       80

## 데이터가 한 개일때 Series가 아니라 DataFrame 유지하기
- []안에 다시 []를 넣으면 된다.

In [10]:
math = exam[['math']]
math.head()

   math
0    50
1    60
2    45
3    30
4    25

In [11]:
math.describe()

            math
count  20.000000
mean   57.450000
std    20.299015
min    20.000000
25%    45.750000
50%    54.000000
75%    75.750000
max    90.000000

## 변수 제거하기
- df.drop(columns = '제거할 변수명') 사용하기

In [13]:
# math 제거
exam.drop(columns = 'math').head()

   id  nclass  english  science
0   1       1       98       50
1   2       1       97       60
2   3       1       86       78
3   4       1       98       58
4   5       2       80       65

In [14]:
# id, nclass 제거
exam.drop(columns = ['id', 'nclass']).head()

   math  english  science
0    50       98       50
1    60       97       60
2    45       86       78
3    30       98       58
4    25       80       65

## pandas 함수 조합하기

### - query()와 [] 조합하기
- 1반 학생의 영어 점수 추출하기

In [15]:
exam.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

In [16]:
exam.query('nclass == 1')

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58

In [17]:
exam.query('nclass == 1')['english']

0    98
1    97
2    86
3    98
Name: english, dtype: int64

- 수학 점수가 50점 이상인 학생의 id와 math 변수 추출하기

In [19]:
exam.query('math >= 50')[['id', 'math']]

    id  math
0    1    50
1    2    60
5    6    50
6    7    80
7    8    90
9   10    50
10  11    65
14  15    75
15  16    58
16  17    65
17  18    80
18  19    89
19  20    78

In [20]:
exam.query('math >= 50')[['id', 'math']].head()

   id  math
0   1    50
1   2    60
5   6    50
6   7    80
7   8    90

In [21]:
# 가독성 있게 코드 줄 바꾸기
exam.query('math >= 50') \
    [['id', 'math']] \
    .head()

   id  math
0   1    50
1   2    60
5   6    50
6   7    80
7   8    90

# 혼자서 해보기
#### 1. mpg 데이터는 11개 변수로 구성. 이 중 일부만 추출해 분석에 활용하려고 함<br> mpg 데이터에서 category(자동차 종류), cty(도시 연비) 변수를 추출해 새로운 데이터를 만들자.<br> 새로 만든 데이터의 일부를 출력해 두 변수로만 구성되어 있는지 확인

In [22]:
mpg = pd.read_csv('./data/mpg.csv')
mpg.head()

  manufacturer model  displ  year  cyl       trans drv  cty  hwy fl category
0         audi    a4    1.8  1999    4    auto(l5)   f   18   29  p  compact
1         audi    a4    1.8  1999    4  manual(m5)   f   21   29  p  compact
2         audi    a4    2.0  2008    4  manual(m6)   f   20   31  p  compact
3         audi    a4    2.0  2008    4    auto(av)   f   21   30  p  compact
4         audi    a4    2.8  1999    6    auto(l5)   f   16   26  p  compact

In [23]:
new_mpg = mpg[['category', 'cty']]
new_mpg.head()

  category  cty
0  compact   18
1  compact   21
2  compact   20
3  compact   21
4  compact   16

#### 2. 자동차 종류에 따라 도시 연비가 어떻게 다른지 알아보려고 한다.<br>앞에서 추출한 데이터를 이용해 category(자동차 종류)가 'suv'인 자동차와 'compact'인 자동차 중 어떤 자동차의 cty(도시 연비) 평균이 더 높은지 알아보자.

In [31]:
new_mpg.query('category == "suv"')['cty'].mean()

13.5

In [32]:
new_mpg.query('category == "compact"')['cty'].mean()

20.127659574468087

#### 답: compact인 자동차가 더 높음